{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.3.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                28,
                28,
                1
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "conv2d_input"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "batch_input_shape": [
                null,
                28,
                28,
                1
              ],
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                5,
                5
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "same",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                5,
                5
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "same",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.6,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv2d/kernel",
          "shape": [
            5,
            5,
            1,
            32
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.4960791994543637,
            "scale": 0.003179994868297203,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d/bias",
          "shape": [
            32
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.13827248128021466,
            "scale": 0.000667983001353694,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [
            5,
            5,
            32,
            64
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.5360635687323178,
            "scale": 0.0038845186140023026,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.06358771487778309,
            "scale": 0.0005942777091381597,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense/kernel",
          "shape": [
            1024,
            128
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.4296292550423566,
            "scale": 0.0034929207727020864,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.06855896711349486,
            "scale": 0.0006407380104064941,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            1
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.591340711070042,
            "scale": 0.004768876702177759,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_1/bias",
          "shape": [
            1
          ],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.6116847395896912,
            "scale": 1.0,
            "original_dtype": "float32"
          }
        }
      ]
    }
  ]
}